sensmonitor/smonitor-iot/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=7168
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_NOTIFY_PHASE_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
# CONFIG_LWIP_PPP_ENABLE_IPV6 is not set

CONFIG_SMONITOR_MODEM_APN=""
CONFIG_SMONITOR_MODEM_USERNAME=""
CONFIG_SMONITOR_MODEM_PASSWORD=""
CONFIG_SMONITOR_MODEM_AUTH_NONE=y
# CONFIG_SMONITOR_MODEM_NETWORK_AUTO=y
# CONFIG_SMONITOR_MODEM_NETWORK_LTE=y
# CONFIG_SMONITOR_MODEM_NETWORK_NB_IOT=y
# CONFIG_SMONITOR_MODEM_NETWORK_LTE_M=y
# CONFIG_SMONITOR_MODEM_NETWORK_GPRS=y
CONFIG_SMONITOR_MODEM_LPWA_BAND=20
CONFIG_SMONITOR_SAMPLE_INTERVAL_MS=5000
CONFIG_SMONITOR_BATTERY_ADC_SAMPLE_COUNT=16
CONFIG_SMONITOR_BATTERY_READ_INTERVAL_SECONDS=300
CONFIG_SMONITOR_MODEM_CONNECT_TIMEOUT_MS=180000

CONFIG_SMONITOR_I2C_FREQUENCY_HZ=100000
